Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала проекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания проекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИсполнителиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ИсполнителиЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГруппаИсполнителейЗадач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыИсполнителейЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыСкладов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Оптовый</Name>
					<Comment>(Общ) Оптовый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розничный</Name>
					<Comment>(Общ) Розничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НТТ</Name>
					<Comment>(Общ) Неавтоматизированная торговая точка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Склады.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Склады</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦенРозничнойТорговли</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСклада</Name>
					<Comment>(Общ) Вид склада: оптовый, розничный, неавтоматизированная торговая точка</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСкладов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетРозничныхЦенПоТорговойНаценке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммовойУчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерриторияПоКОАТУУ</Name>
					<Comment>Название и код территории по КОАТУУ, на которой расположен склад (торговая точка)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторКОАТУУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКАТОТТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>19</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяИнспекция</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеИнспекции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветственныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГруппыИсполнителейЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ГруппыИсполнителейЗадач</Name>
			<Comment>Служебный, не редактируется пользователем</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйОбъектАдресации</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ОбъектыАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Проекты/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ЭтоНовый() Тогда
		
		Если ЭтоГруппа И НЕ ЗначениеЗаполнено(НайтиГруппу(Наименование)) Тогда
			
			СпрГр = Справочники.Склады.СоздатьГруппу();
			СпрГр.Наименование = "Склади " + Наименование;
			СпрГр.Записать();
		
		КонецЕсли;
		
		Если НЕ ЭтоГруппа И ЗначениеЗаполнено(Родитель) Тогда
			
			НайденнаяГруппа = НайтиГруппу(Родитель);
			
			Если ЗначениеЗаполнено(НайденнаяГруппа) Тогда
				СпрОб = Справочники.Склады.СоздатьЭлемент();
				СпрОб.Родитель = НайденнаяГруппа;
				СпрОб.ВидСклада = Перечисления.ВидыСкладов.Оптовый;
				СпрОб.Наименование = Наименование;
				СпрОб.Записать();
			КонецЕсли;
			
		КонецЕсли;
		
		//Дандали В. 21.08.2025 +
		Если НЕ ЭтоГруппа Тогда
			ПользовательОтправкиПоПочте = Справочники.Пользователи.НайтиПоНаименованию("Почтовый пользователь", Истина);
			СписокПолучателей = Новый СписокЗначений;
			СписокПолучателей.Добавить("y.volchenkov@vechir.ua");//y.volchenkov@vechir.ua
			ТекстПисьма = "Створено проект " + Наименование;
			
			СтрПисьма = Новый Структура;
			СтрПисьма.Вставить("ОтправленоФоном", Истина);
			СтрПисьма.Вставить("Тело", ТекстПисьма);
			СтрПисьма.Вставить("Тема", "Новий проект");
			СтрПисьма.Вставить("УчетнаяЗапись", Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("Автоматична система відправки повідоплень"));
			СтрПисьма.Вставить("Кому", СписокПолучателей);
			СтрПисьмо = УправлениеЭлектроннойПочтой.НаписатьПисьмо(ПользовательОтправкиПоПочте, СтрПисьма,,,,,,,Ложь); 
			СтрПисьмо.Письмо.ОтправитьПисьмо(, ПользовательОтправкиПоПочте);
		КонецЕсли;
		//Дандали В. 21.08.2025 -
		
	КонецЕсли;
	
КонецПроцедуры

Функция НайтиГруппу(Родитель) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	НЕ Склады.ПометкаУдаления
		|	И Склады.Наименование = &Наименование
		|	И Склады.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Наименование", "Склади " + Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;	
	КонецЕсли;
	
КонецФункции

Процедура ПриЗаписи(Отказ)
	ЭлементСклад = Справочники.Склады.НайтиПоНаименованию(Наименование);
	Если ЭлементСклад.Пустая() Тогда 
		ЭлементСклад 				= Справочники.Склады.СоздатьЭлемент();
		ЭлементСклад.ВидСклада 		= Перечисления.ВидыСкладов.Оптовый;
		ЭлементСклад.Родитель		= Справочники.Склады.НайтиПоКоду(Родитель.Код,Истина);
		ЭлементСклад.Наименование 	= Наименование;
		ЭлементСклад.Записать();
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(РуководительПроекта) Тогда 
		Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ГруппыИсполнителейЗадач.Ссылка
		               |ИЗ
		               |	Справочник.ГруппыИсполнителейЗадач КАК ГруппыИсполнителейЗадач
		               |ГДЕ
		               |	ГруппыИсполнителейЗадач.РольИсполнителя = &РольИсполнителя
		               |	И ГруппыИсполнителейЗадач.ОсновнойОбъектАдресации = &ОсновнойОбъектАдресации";
		Запрос.УстановитьПараметр("РольИсполнителя",Справочники.РолиИсполнителей.анРуководительПроекта);
		Запрос.УстановитьПараметр("ОсновнойОбъектАдресации",Ссылка);
		
		РезультатЗапроса = запрос.Выполнить().Выгрузить();
		
		Если не РезультатЗапроса.Количество() Тогда 
			Элемент = Справочники.ГруппыИсполнителейЗадач.СоздатьЭлемент();
			Элемент.РольИсполнителя         = Справочники.РолиИсполнителей.анРуководительПроекта;
			Элемент.ОсновнойОбъектАдресации = Ссылка;
			Элемент.Наименование = строка(""+Справочники.РолиИсполнителей.анРуководительПроекта+" ,"+Ссылка);
			Элемент.Записать();
			
			Элемент = Элемент.Ссылка;
		Иначе
			Элемент = РезультатЗапроса[0].ссылка;
		КонецЕсли;
		
		НаборЗаписей 							= РегистрыСведений.ИсполнителиЗадач.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ОсновнойОбъектАдресации.установить(Ссылка);
		НаборЗаписей.Отбор.РольИсполнителя.установить(Справочники.РолиИсполнителей.анРуководительПроекта);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
		МенежерЗаписей = РегистрыСведений.ИсполнителиЗадач.СоздатьМенеджерЗаписи();
		МенежерЗаписей.Активность	 			= Истина;
		МенежерЗаписей.ГруппаИсполнителейЗадач 	= Элемент;
		МенежерЗаписей.Исполнитель 				= РуководительПроекта;
		МенежерЗаписей.ОсновнойОбъектАдресации  = Ссылка;
		МенежерЗаписей.РольИсполнителя 			= Справочники.РолиИсполнителей.анРуководительПроекта; 
		МенежерЗаписей.Записать(Истина);	
	КонецЕсли;

КонецПроцедуры
